#+title: Sprint Backlog 01 for Niam
#+options: date:nil toc:nil author:nil num:nil
#+todo: STARTED | COMPLETED CANCELLED POSTPONED
#+tags: { story(s) epic(e) }

* Mission Statement

- create football manager program

* Stories

** Active

#+begin: clocktable :maxlevel 3 :scope subtree :indent nil :emphasize nil :scope file :narrow 75 :formula %
#+CAPTION: Clock summary at [2018-03-08 Thu 15:07]
| <75>                                                                        |         |       |      |       |
| Headline                                                                    | Time    |       |      |     % |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| *Total time*                                                                | *18:28* |       |      | 100.0 |
|-----------------------------------------------------------------------------+---------+-------+------+-------|
| Stories                                                                     | 18:28   |       |      | 100.0 |
| Active                                                                      |         | 18:28 |      | 100.0 |
| STARTED Sprint and product backlog grooming                                 |         |       | 0:30 |   2.7 |
| COMPLETED Clone hedgr                                                       |         |       | 0:30 |   2.7 |
| COMPLETED Diagram                                                           |         |       | 1:00 |   5.4 |
| COMPLETED Create table standings classes                                    |         |       | 1:18 |   7.0 |
| COMPLETED Review                                                            |         |       | 0:20 |   1.8 |
| COMPLETED Create match classes                                              |         |       | 2:06 |  11.4 |
| COMPLETED Test Program                                                      |         |       | 0:23 |   2.1 |
| COMPLETED Discuss tasks                                                     |         |       | 0:19 |   1.7 |
| COMPLETED Add constructors to table class                                   |         |       | 0:29 |   2.6 |
| COMPLETED Add to table classes                                              |         |       | 4:56 |  26.7 |
| COMPLETED Fix table function                                                |         |       | 1:32 |   8.3 |
| COMPLETED Add setw to table                                                 |         |       | 1:00 |   5.4 |
| COMPLETED Discuss tasks                                                     |         |       | 0:35 |   3.2 |
| COMPLETED Analyse code                                                      |         |       | 2:21 |  12.7 |
| COMPLETED fix table bug                                                     |         |       | 1:09 |   6.2 |
#+TBLFM: $5='(org-clock-time% @3$2 $2..$4);%.1f
#+end:

*** STARTED Sprint and product backlog grooming                       :story:
    CLOCK: [2018-03-06 Tue 16:00]--[2018-03-06 Tue 16:30] =>  0:30

Updates to sprint and product backlog

*** COMPLETED Clone hedgr
    CLOSED: [2018-03-06 Tue 10:58]
    CLOCK: [2018-03-06 Tue 09:30]--[2018-03-06 Tue 10:00] =>  0:30
git clone : (copy address from github)
*** COMPLETED Diagram
    CLOSED: [2018-03-06 Tue 11:00]
    CLOCK: [2018-03-06 Tue 10:00]--[2018-03-06 Tue 11:00] =>  1:00
Pull Diagram changes
Review Diagram
Discuss
*** COMPLETED Create table standings classes
    CLOSED: [2018-03-06 Tue 12:18]
    CLOCK: [2018-03-06 Tue 11:00]--[2018-03-06 Tue 12:18] =>  1:18
1. rename table to table_standings
2. remove all the stuff in it
3. add the vector
4. create table_standings_entry
5. add the properties

*** COMPLETED Review
    CLOSED: [2018-03-06 Tue 13:53]
    CLOCK: [2018-03-06 Tue 12:30]--[2018-03-06 Tue 12:50] =>  0:20
- Look at PG changes
- Look at diagram (match/matchday)
*** COMPLETED Create match classes
    CLOSED: [2018-03-06 Tue 16:00]
    CLOCK: [2018-03-06 Tue 13:54]--[2018-03-06 Tue 16:00] =>  2:06
- fix push
0 - create list of objectives
1 - think about match object in real life terms
2 - remove any match related code
3 - create match class files
4 - add properties
5 - create match day class
6 - add properties
*** COMPLETED Test Program
    CLOSED: [2018-03-06 Tue 16:54]
    CLOCK: [2018-03-06 Tue 16:30]--[2018-03-06 Tue 16:53] =>  0:23
- check changes
- check what works
*** COMPLETED Discuss tasks
    CLOSED: [2018-03-07 Wed 09:19]
    CLOCK: [2018-03-07 Wed 09:00]--[2018-03-07 Wed 09:19] =>  0:19

*** COMPLETED Add constructors to table class
    CLOSED: [2018-03-07 Wed 09:31]
    CLOCK: [2018-03-07 Wed 09:32]--[2018-03-07 Wed 09:45] =>  0:13
    CLOCK: [2018-03-07 Wed 09:15]--[2018-03-07 Wed 09:31] =>  0:16

*** COMPLETED Add to table classes
    CLOSED: [2018-03-07 Wed 14:45]
    CLOCK: [2018-03-07 Wed 09:49]--[2018-03-07 Wed 14:45] =>  4:56

1. class table_standings does not have a display method
2. add a test for your work
in order to do a test just do something simple like create a function in main that creates a dummy table

and calls display on it

test_table_standings() for example

then call it from main just to test

when doing the test just create standings with "random" data, e.g. team="my team" games =12, etc

dont bother reading it etc, should be really simple and self contained, you just want to instantiate a table quickly to see if the display is right

actually maybe the team names should be vaguely sensible since that affects the display

also i think patrick already wrote some code to display a table somewhere, have a look at that pls

*** COMPLETED Fix table function
    CLOSED: [2018-03-07 Wed 16:47]
    CLOCK: [2018-03-07 Wed 15:15]--[2018-03-07 Wed 16:47] =>  1:32

1. clean up generation using my approach above

t.push_back(standings_table_entry("Man-United", 9, 1, 1, 19, 11));

2. update team names to be the longest possible so you can test the width
http://en.cppreference.com/w/cpp/io/manip/setw
e.g.


    std::cout << "no setw:" << 42 << '\n'
              << "setw(6):" << std::setw(6) << 42 << '\
*** COMPLETED Add setw to table
    CLOSED: [2018-03-08 Thu 10:00]
    CLOCK: [2018-03-08 Thu 09:00]--[2018-03-08 Thu 10:00] =>  1:00

ttp://en.cppreference.com/w/cpp/io/manip/setw
e.g.


    std::cout << "no setw:" << 42 << '\n'
              << "setw(6):" << std::setw(6) << 42 << '\
*** COMPLETED Discuss tasks
    CLOSED: [2018-03-08 Thu 10:45]
    CLOCK: [2018-03-08 Thu 10:10]--[2018-03-08 Thu 10:45] =>  0:35
ok chaps, i've integrated all the code you have created thus far into one single game

it does not do a lot really

but it allows you to add users

and see the standings

it links up the data model with the game engine

pls pull then spend the rest of your day analysing the code and making small changes

*** COMPLETED Analyse code
    CLOSED: [2018-03-08 Thu 13:56]
    CLOCK: [2018-03-08 Thu 10:47]--[2018-03-08 Thu 13:08] =>  2:21

*** COMPLETED fix table bug
    CLOSED: [2018-03-08 Thu 15:06]
    CLOCK: [2018-03-08 Thu 13:57]--[2018-03-08 Thu 15:06] =>  1:09

** Deprecated
